; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 860232 2 2 2 5 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	spectrograph0 - mode
	thermograph1 - mode
	GroundStation1 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	Star2 - direction
	Star5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Star9 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
	(supports instrument2 spectrograph0)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star2)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
)
(:goal (and
	(have_image Star5 spectrograph0)
	(have_image Planet6 thermograph1)
	(have_image Phenomenon7 thermograph1)
	(have_image Star8 spectrograph0)
	(have_image Star9 spectrograph0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 5
3. (turn_to satellite0 groundstation0 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 5
4. (turn_to satellite1 star9 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 star9)
   goals met: 0 of 5
5. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 5
6. (turn_to satellite1 star5 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star5)
   goals met: 0 of 5
7. (turn_to satellite0 star8 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star8)
   goals met: 0 of 5
8. (turn_to satellite1 star9 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star9)
   goals met: 0 of 5
9. (take_image satellite0 star8 instrument0 spectrograph0)
   added: (have_image star8 spectrograph0)
   goals met: 1 of 5
10. (turn_to satellite1 planet6 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 planet6)
   goals met: 1 of 5
11. (turn_to satellite0 star5 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star5)
   goals met: 1 of 5
12. (turn_to satellite1 star9 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star9)
   goals met: 1 of 5
13. (take_image satellite0 star5 instrument0 spectrograph0)
   added: (have_image star5 spectrograph0)
   goals met: 2 of 5
14. (turn_to satellite1 phenomenon7 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 phenomenon7)
   goals met: 2 of 5
15. (turn_to satellite0 planet6 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet6)
   goals met: 2 of 5
16. (turn_to satellite1 star9 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 star9)
   goals met: 2 of 5
17. (take_image satellite0 planet6 instrument0 thermograph1)
   added: (have_image planet6 thermograph1)
   goals met: 3 of 5
18. (turn_to satellite1 star2 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star2)
   goals met: 3 of 5
19. (turn_to satellite0 phenomenon7 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon7)
   goals met: 3 of 5
20. (calibrate satellite1 instrument2 star2)
   added: (calibrated instrument2)
   goals met: 3 of 5
21. (take_image satellite0 phenomenon7 instrument0 thermograph1)
   added: (have_image phenomenon7 thermograph1)
   goals met: 4 of 5
22. (turn_to satellite1 star9 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 star9)
   goals met: 4 of 5
23. (take_image satellite1 star9 instrument2 spectrograph0)
   added: (have_image star9 spectrograph0)
   goals met: 5 of 5
